---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.RebarSystemBarTypeFrontDirn1
source: html/db8692a0-0cfa-8198-7638-d8e6c4949bc4.htm
---
# Autodesk.Revit.DB.ParameterTypeId.RebarSystemBarTypeFrontDirn1 Property

"Exterior Major Bar Type"

## Syntax (C#)
```csharp
public static ForgeTypeId RebarSystemBarTypeFrontDirn1 { get; }
```